neon-smart-studio/W-Link_NeonRTOS_Platform/src/W-Link/Driver/DMA/Device/STM32/DMA_STM32WB.c
        g_dma[channel_index].Init.PeriphInc           = DMA_PINC_DISABLE;
        g_dma[channel_index].Init.MemInc              = DMA_MINC_ENABLE;
        g_dma[channel_index].Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        g_dma[channel_index].Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
        g_dma[channel_index].Init.Mode                = DMA_NORMAL;
        g_dma[channel_index].Init.Priority            = DMA_PRIORITY_HIGH;

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        g_dma[channel_index].Init.Direction = DMA_MEMORY_TO_PERIPH;

                        switch(index)
                        {
#if defined(I2C1_BASE)
                                case hwI2C_Index_0:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_I2C1_TX;
                                        break;
#endif
#if defined(I2C2_BASE)
                                case hwI2C_Index_1:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_I2C2_TX;
                                        break;
#endif
#if defined(I2C3_BASE)
                                case hwI2C_Index_2:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_I2C3_TX;
                                        break;
#endif
                        }
                        break;

                case hwDMA_Peripheral_Direction_RX:
                        g_dma[channel_index].Init.Direction = DMA_PERIPH_TO_MEMORY;
                        
                        switch(index)
                        {
#if defined(I2C1_BASE)
                                case hwI2C_Index_0:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_I2C1_RX;
                                        break;
#endif
#if defined(I2C2_BASE)
                                case hwI2C_Index_1:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_I2C2_RX;
                                        break;
#endif
#if defined(I2C3_BASE)
                                case hwI2C_Index_2:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_I2C3_RX;
                                        break;
#endif
                        }
                        break;
        }

        if (HAL_DMA_Init(&g_dma[channel_index]) != HAL_OK)
        {
                return hwDMA_HwError;
        }

        switch (dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                __HAL_LINKDMA(&g_i2c[index], hdmatx, g_dma[channel_index]);
                break;

                case hwDMA_Peripheral_Direction_RX:
                __HAL_LINKDMA(&g_i2c[index], hdmarx, g_dma[channel_index]);
                break;

                default:
                return hwDMA_InvalidParameter;
        }

        return hwDMA_OK;
}

static hwDMA_OpResult DMA_Config_SPI(hwDMA_Channel_Index channel_index, hwDMA_Peripheral_Direction dir, hwSPI_Index index)
{
        if(dir>=hwDMA_Peripheral_Direction_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(channel_index>=hwDMA_Channel_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(index>=hwSPI_Index_MAX)
        {
                return hwDMA_InvalidParameter;
        }

        if(DMA_Channel_Init_Status[channel_index]==false)
        {
                return hwDMA_NotInit;
        }

        g_dma[channel_index].Instance = DMA_Get_Instance(channel_index);
        if(g_dma[channel_index].Instance == NULL)
        {
                return hwDMA_InvalidParameter;
        }

        g_dma[channel_index].Init.PeriphInc           = DMA_PINC_DISABLE;
        g_dma[channel_index].Init.MemInc              = DMA_MINC_ENABLE;
        g_dma[channel_index].Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        g_dma[channel_index].Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
        g_dma[channel_index].Init.Mode                = DMA_NORMAL;
        g_dma[channel_index].Init.Priority            = DMA_PRIORITY_HIGH;

        switch(dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        g_dma[channel_index].Init.Direction = DMA_MEMORY_TO_PERIPH;

                        switch(index)
                        {
#if defined(SPI1_BASE)
                                case hwSPI_Index_0:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_SPI1_TX;
                                        break;
#endif
#if defined(SPI2_BASE)
                                case hwSPI_Index_1:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_SPI2_TX;
                                        break;
#endif
                        }
                        break;
                case hwDMA_Peripheral_Direction_RX:
                        g_dma[channel_index].Init.Direction = DMA_PERIPH_TO_MEMORY;
                        
                        switch(index)
                        {
#if defined(SPI1_BASE)
                                case hwSPI_Index_0:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_SPI1_RX;
                                        break;
#endif
#if defined(SPI2_BASE)
                                case hwSPI_Index_1:
                                        g_dma[channel_index].Init.Request = DMA_REQUEST_SPI2_RX;
                                        break;
#endif
                        }
                        break;
        }

        if (HAL_DMA_Init(&g_dma[channel_index]) != HAL_OK)
        {
                return hwDMA_HwError;
        }

        switch(dir)
        {
                case hwDMA_Peripheral_Direction_TX:
                        __HAL_LINKDMA(&g_spi[index], hdmatx, g_dma[channel_index]);
                        break;
                case hwDMA_Peripheral_Direction_RX:
                        __HAL_LINKDMA(&g_spi[index], hdmarx, g_dma[channel_index]);
                        break;
        }

